# 6. Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество.
# Важно, чтобы для каждого предмета не обязательно были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
# Примеры строк файла:
# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
#
# Пример словаря:
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

with open('text5_6.txt', 'r', encoding='utf-8') as f:
    disciplines = {}
    for line in f:
        line = line.replace('\n', '')
        line = line.replace('(л)', '')
        line = line.replace('(пр)', '')
        line = line.replace('(лаб)', '')
        line = line.replace(':', '')
        line = line.split(' ')
        if line[1] != '—':
            line[1] = int(line[1])
        else:
            line[1] = 0
        if line[2] != '—':
            line[2] = int(line[2])
        else:
            line[2] = 0
        if line[3] != '—':
            line[3] = int(line[3])
        else:
            line[3] = 0
        sum_hours = line[1] + line[2] + line[3]
        disciplines[line[0]] = sum_hours
    print(disciplines)
